; -----------------------------------------
; ЛР №3
; -----------------------------------------
; Архітектура комп'ютера
; Завдання: 
; ВУЗ: КНУУ "КПІ"
; Факультет: ФІОТ
; Курс: 1
; Група: ІТ-03
; -----------------------------------------
; Автори:	Бражник О.О.
;			Король К.В.
;			Федяй Б.В.
; Дата: 17/03/2021
; -----------------------------------------

;					І. Заголовок програми
IDEAL
MODEL small
STACK 256
;					ІІ. Макроси
MACRO M_init		; Макрос для ініціалізації. Його початок
	mov ax, @data	; @data ідентифікатор, що створюються директивою MODEL
	mov ds, ax		; Завантаження початку сегменту даних в регістр DS
	mov es, ax		; Завантаження початку сегменту даних в регістр ES
	ENDM M_init		; Кінець макросу
array_length equ 255
;					ІІІ. Початок сегменту даних
DATASEG
array2Db db 201d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 187d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 186d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 000d, 186d
		 db 200d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 205d, 188d
letters db "BFKKOB"
letters_offset dw 0
letters_index dw 0
array_index dw 0
exCode db 0
;					IV. Початок сегменту коду
CODESEG
Start:
	M_init	; Виклик макросу для ініціалізації
	; -----------------------------------------
	; Вираховуэмо адресу початку строки letters
	mov dx, offset letters
	mov [letters_offset], dx
	; Вираховуємо адресу початку діагоналі
	mov dx, offset array2Db
	add dx, 1*16+15			; Стартова позиція діаогналі відносно початку array2Db
	mov [array_index], dx
	; Цикл для заповнення діагоналі
	FILLER:
	; Дістаємо потрібний нам символ із строки letters --> AX
	mov bx, [letters_offset]
	add bx, [letters_index]
	mov ah, [bx]
	; Переходимо до наступного символа строки letters (по колу)
	inc [letters_index]
	cmp [letters_index], 6
	jne NOT_END
	mov [letters_index], 0
	NOT_END:
	; Записуємо отриманий символ у діагональ
	mov bx, [array_index]
	mov [bx], ah
	; Перехід до наступної строки (або вихід)
	add bx, 15
	mov [array_index], bx
	cmp bx, array_length
	jc FILLER
	; -----------------------------------------
	mov ah, 4ch			; Завантаження числа 01h до регістру AH 
	mov al, [exCode]	; Завантаження значення exCode до регістру AL
	int 21h				; Виклик преривання 21h (AH = 4ch, AL = код виходу - команда виходу із програми)
	end Start