; -----------------------------------------
; ЛР №2
; -----------------------------------------
; Архітектура комп'ютера
; Завдання: основи розробки та налагодження
; ВУЗ: КНУУ "КПІ"
; Факультет: ФІОТ
; Курс: 1
; Група: ІТ-03
; -----------------------------------------
; Автори:	Букрєєв М.С.
;			Король К.В.
;			Федяй Б.В.
; Дата: 11/02/2021
; -----------------------------------------

;					І. Заголовок програми
IDEAL
MODEL small
STACK 256
;					ІІ. Макроси
MACRO M_init		; Макрос для ініціалізації. Його початок
	mov ax, @data	; @data ідентифікатор, що створюються директивою MODEL
	mov ds, ax		; Завантаження початку сегменту даних в регістр DS
	mov es, ax		; Завантаження початку сегменту даних в регістр ES
	ENDM M_init		; Кінець макросу
;					ІІІ. Початок сегменту даних
DATASEG
exCode db 0
rect_line db 31h, 31h, 32h, 31h, 33h, 31h, 00h, 31h, 00h, 31h, 33h, 31h, 00h, 31h, 00h, 31h
rect_line_length=$-rect_line
test_data dw 0aa77h, 0aa77h, 0aa77h
test_data_length=$-test_data
;					IV. Початок сегменту коду
CODESEG
Start:
	M_init	; Виклик макросу для ініціалізації
	; -----------------------------------------
	mov dx, 1604
	mov ax, 0B800h
	mov es, ax
	mov di, dx
	mov si, offset rect_line
	mov cx, rect_line_length
	cld
	rep movsb
	; -----------------------------------------
	mov ah, 4ch			; Завантаження числа 01h до регістру AH 
	mov al, [exCode]	; Завантаження значення exCode до регістру AL
	int 21h				; Виклик преривання 21h (AH = 4ch, AL = код виходу - команда виходу із програми)
	end Start