BEGIN TRANSACTION;
CREATE TABLE IF NOT EXISTS "Довідник рецептів для ліків" (
	"ID Технології"	INTEGER NOT NULL,
	"ID Компоненту"	INTEGER NOT NULL,
	"Кількість"	INTEGER NOT NULL,
	FOREIGN KEY("ID Технології") REFERENCES "Довідник технологій"("ID"),
	FOREIGN KEY("ID Компоненту") REFERENCES "Компоненти"("ID")
);
CREATE TABLE IF NOT EXISTS "Виконані замовлення" (
	"ID Замовлення"	INTEGER,
	FOREIGN KEY("ID Замовлення") REFERENCES "Замовлення"("ID"),
	PRIMARY KEY("ID Замовлення")
);
CREATE TABLE IF NOT EXISTS "Довідник технологій" (
	"ID"	INTEGER,
	"Назва ліків"	TEXT NOT NULL,
	"Сопсіб приготування"	TEXT NOT NULL,
	"Час приготування"	TEXT,
	PRIMARY KEY("ID" AUTOINCREMENT)
);
CREATE TABLE IF NOT EXISTS "Замовлення" (
	"ID"	INTEGER,
	"ПІБ Лікаря"	TEXT,
	"ПІБ Пацієнта"	TEXT NOT NULL,
	"Вік"	INTEGER NOT NULL,
	"Діагноз"	TEXT,
	"ID Повного рецепту"	INTEGER NOT NULL,
	"Час видачі замовлення"	TEXT NOT NULL,
	PRIMARY KEY("ID" AUTOINCREMENT)
);
CREATE TABLE IF NOT EXISTS "Компоненти" (
	"ID"	INTEGER,
	"Назва"	TEXT NOT NULL,
	"Спосіб зберігання"	TEXT,
	"Критична норма"	BLOB NOT NULL,
	"Кількість"	INTEGER,
	PRIMARY KEY("ID" AUTOINCREMENT)
);
CREATE TABLE IF NOT EXISTS "Рецепт для замовника" (
	"ID"	INTEGER NOT NULL,
	"ID Ліків"	INTEGER NOT NULL,
	"Кількість"	INTEGER NOT NULL,
	"Спосіб застосування"	TEXT,
	PRIMARY KEY("ID" AUTOINCREMENT)
);
CREATE TABLE IF NOT EXISTS "Довідник рецептів для замовника" (
	"ID"	INTEGER NOT NULL,
	"ID Рецепту"	INTEGER NOT NULL,
	FOREIGN KEY("ID Рецепту") REFERENCES "Рецепт для замовника"("ID")
);
CREATE TABLE IF NOT EXISTS "Ліки" (
	"ID"	INTEGER NOT NULL,
	"Тип виготовлення"	TEXT NOT NULL,
	"Тип ліків"	TEXT NOT NULL,
	"Назва"	TEXT NOT NULL,
	"Спосіб зберігання"	TEXT,
	"Ціна"	REAL NOT NULL,
	"Кількість"	INTEGER,
	"Критична норма"	REAL,
	"ID Технології"	INTEGER UNIQUE,
	FOREIGN KEY("ID Технології") REFERENCES "Довідник технологій"("ID"),
	PRIMARY KEY("ID" AUTOINCREMENT)
);
INSERT INTO "Довідник рецептів для ліків" VALUES (1,5,100);
INSERT INTO "Довідник рецептів для ліків" VALUES (1,6,10);
INSERT INTO "Довідник рецептів для ліків" VALUES (2,5,100);
INSERT INTO "Довідник рецептів для ліків" VALUES (2,7,20);
INSERT INTO "Довідник рецептів для ліків" VALUES (3,8,0.12);
INSERT INTO "Довідник рецептів для ліків" VALUES (3,9,4);
INSERT INTO "Довідник рецептів для ліків" VALUES (3,10,4);
INSERT INTO "Довідник рецептів для ліків" VALUES (3,11,10);
INSERT INTO "Довідник рецептів для ліків" VALUES (3,12,4);
INSERT INTO "Довідник рецептів для ліків" VALUES (4,2,30);
INSERT INTO "Довідник рецептів для ліків" VALUES (4,3,10);
INSERT INTO "Довідник рецептів для ліків" VALUES (4,4,20);
INSERT INTO "Довідник рецептів для ліків" VALUES (5,13,1);
INSERT INTO "Довідник рецептів для ліків" VALUES (5,14,1000);
INSERT INTO "Довідник рецептів для ліків" VALUES (5,15,24);
INSERT INTO "Довідник рецептів для ліків" VALUES (6,1,100);
INSERT INTO "Довідник рецептів для ліків" VALUES (6,16,84);
INSERT INTO "Довідник рецептів для ліків" VALUES (6,15,12);
INSERT INTO "Довідник рецептів для ліків" VALUES (6,17,50);
INSERT INTO "Виконані замовлення" VALUES (1);
INSERT INTO "Виконані замовлення" VALUES (2);
INSERT INTO "Виконані замовлення" VALUES (4);
INSERT INTO "Довідник технологій" VALUES (1,'Мазь із календули','Помістіть у фарфорову або емальовану ємність і підігрійте на водяній бані до рідкого стану 100 г вазеліну або ланоліну. Додайте 10 г сухих розмелених язичкових (помаранчевих) квіток календули.

Зверніть увагу – кошики залишаються для інших випадків. Завадіть, нагрійте 10 хвилин, накрийте кришкою і поставте в темне тепле місце. Через добу суміш помістіть на водяну баню, нагрійте до рідкого стану, не даючи загуснути, процідіть через дрібне сито або марлю в баночку з темного скла.','1 день');
INSERT INTO "Довідник технологій" VALUES (2,'Мазь із арніки','Помістіть у фарфорову або емальовану ємність і підігрійте на водяній бані до рідкого стану 100 г вазеліну або ланоліну. Додайте 20 г сухих розмелених квіток арніки.

Зверніть увагу – кошики залишаються для інших випадків. Завадіть, нагрійте 10 хвилин, накрийте кришкою і поставте в темне тепле місце. Через добу суміш помістіть на водяну баню, нагрійте до рідкого стану, не даючи загуснути, процідіть через дрібне сито або марлю в баночку з темного скла.','1 день');
INSERT INTO "Довідник технологій" VALUES (3,'Мікстура Дрягіна','Налити дистильовану воду у ємність
Розчинити кодеїн у воді
Процедити розчин
Додати хлоралгідрат
Додати бромід натрію
Додати настоянку з корінням валер''яни
Додати настоянку валер''яни','1год');
INSERT INTO "Довідник технологій" VALUES (4,'Чай з імбирем','Насипати повний пакетик чайного листя, вичавити половинку кільця лимону, нарізати трохи імбирю та залити окропом. Подавати у фірменному стакантчику та із трубочкою','2хв');
INSERT INTO "Довідник технологій" VALUES (5,'Настоянка на кобрі','Вбити кобру (обов''язково голими руками) 
Відрізати голову
Нарізати її циліндрами довжиною 5 см
Засипати коброві циліндри у ємність
Залити літром горілки
Дрібно нарізати 2 стручки гострого перцю','3 дні');
INSERT INTO "Довідник технологій" VALUES (6,'Порошок для підняття із мертвих','Натерти корінь мандрагори
Натерти корінь женьшеню
Дрібно нарізати гострий перець
Насипати солі
Перетовкти в ступці, висушити','2год');
INSERT INTO "Замовлення" VALUES (1,'Біс Й.З.','Марина М.М.',26,'Не придумав',1,'05.11.2021 16:10');
INSERT INTO "Замовлення" VALUES (2,'Перерва А.В.','Ян П.І.',20,'Серйозна інтоксикація організму',2,'06.11.2021 9:00');
INSERT INTO "Замовлення" VALUES (3,'Букасов  М.М.','Вовк Є.А.',25,'Приблеми з диханням


(Душний дуже)',3,'06.11.2021 20:00');
INSERT INTO "Замовлення" VALUES (4,'Поліщук В.М.','Поліщук Б.І.',18,'Повірте, якийсь діагноз у нього точно був',4,'06.11.2021 12:00');
INSERT INTO "Компоненти" VALUES (1,'Корінь мандрагори','Зберігати по 1 штуці в окремому контейнеру для кожної. Зберігати за температури нижче 0С','10',25);
INSERT INTO "Компоненти" VALUES (2,'Чайне листя','Зберігати в закритій ємності','200',400);
INSERT INTO "Компоненти" VALUES (3,'Лимон','Зберігати в холодильнику. Вімкненому','2',6);
INSERT INTO "Компоненти" VALUES (4,'Імбир','Зберігати в холодильнику. Вімкненому','2',6);
INSERT INTO "Компоненти" VALUES (5,'Вазилін',NULL,'500',1000);
INSERT INTO "Компоненти" VALUES (6,'Квіти календули','Зберігати в сухому та холодному місці','50',56);
INSERT INTO "Компоненти" VALUES (7,'Квіти арніки','Зберігати в сухому та холодному місці','60',90);
INSERT INTO "Компоненти" VALUES (8,'Кодеїн',NULL,'12',24);
INSERT INTO "Компоненти" VALUES (9,'Хлоралгідрат',NULL,'40',60);
INSERT INTO "Компоненти" VALUES (10,'Бромід натрію',NULL,'40',60);
INSERT INTO "Компоненти" VALUES (11,'Настоянка з корінням валер''яни','Зберігати в холодильнику. Вімкненому','600',1000);
INSERT INTO "Компоненти" VALUES (12,'Настоянка влер''яни','Зберігати в холодильнику. Вімкненому','40',60);
INSERT INTO "Компоненти" VALUES (13,'Кобра (жива)','Годувати мишами 3 рази на день','2',3);
INSERT INTO "Компоненти" VALUES (14,'Горілка','Зберігати подалі від співробітників, схильних до алкоголізму','2000',4000);
INSERT INTO "Компоненти" VALUES (15,'Гострий перець','Зберігати в холодильнику. Вімкненому','30',60);
INSERT INTO "Компоненти" VALUES (16,'Корінь женьшеню','Зберігати в холодильнику. Вімкненому','200',400);
INSERT INTO "Компоненти" VALUES (17,'Сіль кухонна','Зберігати в закритій ємності','300',500);
INSERT INTO "Компоненти" VALUES (18,'Дистильована вода',NULL,'400',666);
INSERT INTO "Рецепт для замовника" VALUES (1,4,2,'текст 1');
INSERT INTO "Рецепт для замовника" VALUES (2,7,1,'текст 2');
INSERT INTO "Рецепт для замовника" VALUES (3,11,100,'текст 3');
INSERT INTO "Рецепт для замовника" VALUES (4,1,1,'текст 4');
INSERT INTO "Рецепт для замовника" VALUES (5,2,1,'текст 5');
INSERT INTO "Рецепт для замовника" VALUES (6,9,1,'текст 6');
INSERT INTO "Рецепт для замовника" VALUES (7,10,1,'текст 7');
INSERT INTO "Довідник рецептів для замовника" VALUES (1,1);
INSERT INTO "Довідник рецептів для замовника" VALUES (1,2);
INSERT INTO "Довідник рецептів для замовника" VALUES (2,3);
INSERT INTO "Довідник рецептів для замовника" VALUES (3,4);
INSERT INTO "Довідник рецептів для замовника" VALUES (3,5);
INSERT INTO "Довідник рецептів для замовника" VALUES (4,6);
INSERT INTO "Довідник рецептів для замовника" VALUES (4,7);
INSERT INTO "Ліки" VALUES (1,'Власне','Мазь','Мазь із календули',NULL,32.4,NULL,NULL,1);
INSERT INTO "Ліки" VALUES (2,'Власне','Мазь','Мазь із арніки',NULL,38.4,NULL,NULL,2);
INSERT INTO "Ліки" VALUES (3,'Власне','Мікстура','Мікстура Дрягіна','Зберігати у герметичній пляшці при холодній температурі',123.45,NULL,NULL,3);
INSERT INTO "Ліки" VALUES (4,'Власне','Розчин','Чай з імбирем','Зберігати не треба - пийте зараз',12.0,NULL,NULL,4);
INSERT INTO "Ліки" VALUES (5,'Власне','Настоянка','Настоянка на кобрі','Зберігати у герметичній пляшці при холодній температурі',250.0,NULL,NULL,5);
INSERT INTO "Ліки" VALUES (6,'Власне','Порошок','Порошок для підняття із мертвих','Зберігати якнайдалі від дітей та органів влади',500.0,NULL,NULL,6);
INSERT INTO "Ліки" VALUES (7,'Імпортоване','Таблетки','Аскорбінки','Зберігати подалі від дітей',12.8,100,20.0,NULL);
INSERT INTO "Ліки" VALUES (8,'Імпортоване','Таблетки','Парацетамол',NULL,92.0,50,15.0,NULL);
INSERT INTO "Ліки" VALUES (9,'Імпортоване','Мазь','Зірка','Зберігати в холодному місці',12.5,240,30.0,NULL);
INSERT INTO "Ліки" VALUES (10,'Імпортоване','Мазь','Спасатель','Зберігати в холодному місці',57.84,50,15.0,NULL);
INSERT INTO "Ліки" VALUES (11,'Імпортоване','Таблетки','Активований вуголь','Зберігати в сухому та темному місці','4.20/таблетка',100,20.0,NULL);
INSERT INTO "Ліки" VALUES (12,'Імпортоване','Таблетки','Но-шпа','Зберігати в недоступному для дітей місці',70.17,134,15.0,NULL);
INSERT INTO "Ліки" VALUES (13,'Імпортоване','Настоянка','Настоянка бояришнику','Зберігати у герметичній пляшці при холодній температурі',15.0,100,10.0,NULL);
COMMIT;
