IDEAL
MODEL small
STACK 256

; ==================================== Макроси ====================================
; ---------------------------------------------------------------------------------
; Призначення: ініціалізація програми
; ---------------------------------------------------------------------------------
MACRO M_init		; Макрос для ініціалізації. Його початок
	mov ax, @data	; @data ідентифікатор, що створюються директивою MODEL
	mov ds, ax		; Завантаження початку сегменту даних в регістр DS
	mov es, ax		; Завантаження початку сегменту даних в регістр ES
	ENDM M_init		; Кінець макросу

; ---------------------------------------------------------------------------------
; Призначення: вихід із програми (із кодом 0)
; ---------------------------------------------------------------------------------
MACRO M_exit
	mov ah, 4ch
	mov al, 0
	int 21h
	ENDM M_exit

DATASEG
msg db "Done!", 10, 13, "$"
spacer db 0, 0, 0, 0, 0, 0, 0, 0
arr dw "1", "2", "3", "4"
dest dw 0, 0, 0, 0
arr_len equ 8

CODESEG
Start:
	M_init
	mov si, offset arr + arr_len - 2	; Указатель на последний элемент изначального списка
	mov bx, offset dest				; Указатель на начало нового списка
	mov cl, arr_len						; Просто длинна нашего массива

	Writer:
		; Переписывание слова из первого списка во второй
		mov dx, [si]
		mov [bx], dx

		inc bx
		inc bx
		dec si
		dec si
		dec cl
		dec cl
		;if (CL != 0) do jump
		jnz Writer
		
	; Оповещение об успешном выполнении задания
	mov dx, offset msg
	mov ah, 09h
	int 21h
	M_exit
	end Start