public class Main {
	public static void main(String[] args) {
		int[] sparseTable = {0,1,0,0,0,8,0,7,0,4,0,0,6,0};

		SparseTable test = new SparseTable(sparseTable);
		test.set(1, 20);
		System.out.println(test.get(20));
	}
}

/*
Реалізувати наступну структуру даних: розріджений список, тобто зберігаються ненульові елементи та їх індекси. 
Реалізувати операції: 
get
set доступу до елементу за індексом
insert вставки елементів на задану позицію
а також sort_nonempty сортування лише ненульових елементів за значенням (нульові елементи залишаються на своїх позиціях). 
Описати часову та просторову складність самої структури даних та реалізованих операцій. 
Можна обрати реалізацію на основі масивів чи зв’язних списків. 
Бонус: реалізувати дві версії на основі масивів та зв’язних списків, порівняти реалізації.
*/